; domain
; ==========================================================
; DOMAIN: SATELLITE
;
; Il satellite può:
;   - ruotare
;   - fotografare oggetti
;   - inviare immagini
;
; Vincoli modellati:
;   - orientamento
;   - memoria
;   - slot immagini
;   - qualità HD / SD
;
; Compatibile con Fast Downward
;
; ==========================================================

(define (domain satellite)

(:requirements
    :strips
    :typing
    :negative-preconditions
)

; ==========================================================
; TIPI

(:types
    direction
    object
)

; ==========================================================
; PREDICATI


(:constants
    N NE E SE S SW W NW - direction
)

(:predicates

    ; orientamento corrente
    (pointing ?d - direction)

    ; oggetto visibile da una direzione
    (visible ?o - object ?d - direction)

    ; foto salvata in memoria
    (stored ?o - object)

    ; foto inviata alla Terra
    (sent ?o - object)

    ; qualità richiesta
    (hd ?o - object)
    (sd ?o - object)

    ; memoria disponibile
    (memory-free)

    ; slot disponibile
    (slot-free)
)

; ==========================================================
; ROTAZIONE DESTRA


(:action rotate-right

    :parameters (?from - direction ?to - direction)

    :precondition
    (pointing ?from)

    :effect
    (and
        (not (pointing ?from))
        (pointing ?to)
    )
)

; ==========================================================
; ROTAZIONE SINISTRA

(:action rotate-left

    :parameters (?from - direction ?to - direction)

    :precondition
    (pointing ?from)

    :effect
    (and
        (not (pointing ?from))
        (pointing ?to)
    )
)

; ==========================================================
; FOTO HD

(:action take-picture-hd

    :parameters (?o - object ?d - direction)

    :precondition
    (and
        (pointing ?d)
        (visible ?o ?d)

        (hd ?o)

        (not (stored ?o))
        (not (sent ?o))

        (memory-free)
        (slot-free)
    )

    :effect
    (and
        (stored ?o)

        (not (memory-free))
        (not (slot-free))
    )
)

; ==========================================================
; FOTO SD

(:action take-picture-sd

    :parameters (?o - object ?d - direction)

    :precondition
    (and
        (pointing ?d)
        (visible ?o ?d)

        (sd ?o)

        (not (stored ?o))
        (not (sent ?o))

        (memory-free)
        (slot-free)
    )

    :effect
    (and
        (stored ?o)

        (not (memory-free))
        (not (slot-free))
    )
)

; ==========================================================
; INVIO HD

(:action send-hd

    :parameters (?o - object ?north - direction)

    :precondition
    (and
        (pointing ?north)

        (stored ?o)
        (hd ?o)
    )

    :effect
    (and
        (not (stored ?o))
        (sent ?o)

        (memory-free)
        (slot-free)
    )
)

; ==========================================================
; INVIO SD

(:action send-sd

    :parameters (?o - object ?north - direction)

    :precondition
    (and
        (pointing ?north)

        (stored ?o)
        (sd ?o)
    )

    :effect
    (and
        (not (stored ?o))
        (sent ?o)

        (memory-free)
        (slot-free)
    )
)

)

; problem
; ==========================================================
; PROBLEM HARD HD
; ==========================================================

(define (problem satellite-hard-hd)

(:domain satellite)

; ==========================================================
; OGGETTI

(:objects

    N E S W NE NW SE SW - direction

    star1 planet1 galaxy1 dust1 junk2 asteroidX - object
)

; ==========================================================
; STATO INIZIALE

(:init

    ; orientamento iniziale
    (pointing SW)

    ; risorse
    (memory-free)
    (slot-free)

    ; visibilità
    (visible star1 E)
    (visible dust1 E)

    (visible planet1 S)
    (visible asteroidX S)

    (visible galaxy1 NW)
    (visible junk2 NW)

    ; qualità immagini
    (hd star1)
    (hd planet1)
    (hd galaxy1)
)

; ==========================================================
; GOAL

(:goal
    (and
        (sent star1)
        (sent planet1)
        (sent galaxy1)
    )
)

)

; plan
1. (rotate-right sw w)
   deleted: (pointing sw)
   added: (pointing w)
   goals met: 0 of 3
2. (rotate-right w nw)
   deleted: (pointing w)
   added: (pointing nw)
   goals met: 0 of 3
3. (take-picture-hd galaxy1 nw)
   deleted: (memory-free) (slot-free)
   added: (stored galaxy1)
   goals met: 0 of 3
4. (rotate-right nw n)
   deleted: (pointing nw)
   added: (pointing n)
   goals met: 0 of 3
5. (send-hd galaxy1 n)
   deleted: (stored galaxy1)
   added: (sent galaxy1) (memory-free) (slot-free)
   goals met: 1 of 3
6. (rotate-right n ne)
   deleted: (pointing n)
   added: (pointing ne)
   goals met: 1 of 3
7. (rotate-right ne e)
   deleted: (pointing ne)
   added: (pointing e)
   goals met: 1 of 3
8. (take-picture-hd star1 e)
   deleted: (memory-free) (slot-free)
   added: (stored star1)
   goals met: 1 of 3
9. (rotate-left e ne)
   deleted: (pointing e)
   added: (pointing ne)
   goals met: 1 of 3
10. (rotate-left ne n)
   deleted: (pointing ne)
   added: (pointing n)
   goals met: 1 of 3
11. (send-hd star1 n)
   deleted: (stored star1)
   added: (sent star1) (memory-free) (slot-free)
   goals met: 2 of 3
12. (rotate-right n ne)
   deleted: (pointing n)
   added: (pointing ne)
   goals met: 2 of 3
13. (rotate-right ne e)
   deleted: (pointing ne)
   added: (pointing e)
   goals met: 2 of 3
14. (rotate-right e se)
   deleted: (pointing e)
   added: (pointing se)
   goals met: 2 of 3
15. (rotate-right se s)
   deleted: (pointing se)
   added: (pointing s)
   goals met: 2 of 3
16. (take-picture-hd planet1 s)
   deleted: (memory-free) (slot-free)
   added: (stored planet1)
   goals met: 2 of 3
17. (rotate-left s se)
   deleted: (pointing s)
   added: (pointing se)
   goals met: 2 of 3
18. (rotate-left se e)
   deleted: (pointing se)
   added: (pointing e)
   goals met: 2 of 3
19. (rotate-left e ne)
   deleted: (pointing e)
   added: (pointing ne)
   goals met: 2 of 3
20. (rotate-left ne n)
   deleted: (pointing ne)
   added: (pointing n)
   goals met: 2 of 3
21. (send-hd planet1 n)
   deleted: (stored planet1)
   added: (sent planet1) (memory-free) (slot-free)
   goals met: 3 of 3
